content/documentation.org
#+TITLE: Création du blorg
#+AUTHOR: Charles-Édouard Lizotte
#+DATE: <2024-01-25>

* L'objectif

** Mise en contexte 
J'adore le langage Org, je le trouve particulièrement efficace pour produire des notes, des agendas et des journaux.
Voici quelques mois que je l'utilise dans le cadre de mon travail et j'aimerais maintenant créer moi-même un blog accessible pour tous.
Par contre, peu de sites web de type blog apprécient le formatage du langage Org, c'est pourquoi je me suis mis en tête de moi-même en créer un.
Ce document contient quelques notes importantes que j'ai prises au fil de mon parcours de création.

** Non, mais concrétement...
Nous allons publier (ou plutôt exporter) un fichier Org en fichier HTML dans le but de créer un site web.
Lorsqu'on entend le mot « *publier »*, on parle généralement de transformer notre fichier *org* en fichier *HTML*.
C'est ce que nous apprendrons à faire dans les prochaines minutes.

* Architecture de fichiers
Avant tout, nous avons besoin d'une forme d'architecture de gestion de nos publications.
Celle proposée par [[https://www.youtube.com/watch?v=AfkrzFodoNw][la chaîne Youtube System Crafter]] fait la plus de sens :
+ *build.sh* : un scrip bash qui exécute la mise à jour de nos fichiers org en fichiers HTML à l'aide du fichier *build-site.el*. 
+ *build-site.el* : un code *elisp* qui s'assure d'exécuter *Emacs* en mode -Q pour publier nos fichiers.
+ Dossier */content* : où l'on retrouve le contenu du site web, comme les fichiers org ou la gabarits CSS.
  + *content/index.org* : un fichier org représentant notre page principale.
+ Dossier */public* : Dossier des fichiers qui seront publiés vers le web (HTML, png, CSS).
  Pour l'instant, on y retrouve que le fichier /index.org/.

Au final, le résultat désiré devrait ressembler à l'arbre suivant : 
#+begin_src sh
.
├── build.sh
├── build-site.el
├── content
│   └── index.org
├── css
│   └── simple.css
├── documentation.org
└── public
    ├── css
    │   └── simple.css
    └── index.html
#+end_src

Le fichier /build.sh/ est un exécutable bash qui met à jour notre site web en exécutant notre script elisp : 
#+begin_src bash
#!/bin/sh
emacs -Q --script build-site.el
#+end_src

* Création d'une configuration de publication web  
Un fois nos scripts de base réalisés, on peut créer une configuration de publication dans le script /build-site.el/.
Commençons par une configuration de publication de nos fichiers HTML.
Les variables de publication devraient ressembler à
#+begin_src elisp
;; Define the publishing project
(setq org-publish-project-alist
      (list
       (list "my-org-site"
   	     :recursive t
   	     :base-directory "./content"
   	     :publishing-directory "./public"
   	     :publishing-function 'org-html-publish-to-html)))

;; Generate the site output
(org-publish-all t)
(message "Build complete!")
#+end_src
À la dernière ligne, la fonction de publication est exécutée de sorte à exporter les nouveaux fichiers HTML dans le dossier /./public/. 

* Un aperçu du site web en ligne
Pour voir un aperçu de notre site web *en ligne*, il existe un module Emacs qui peut abriter notre site sur notre machine, le temps de le tester.
Ce module s'appelle [[https://github.com/skeeto/emacs-web-server/blob/master/simple-httpd.el][simple-httpsd]] et il s'installe à l'aide de MELPA, donc avec la commande « *M-x package-install* » ou en mettant la ligne de code suiante
#+begin_src elisp
(use-package simple-httpd
  :ensure t)
#+end_src
Si ça ne marche pas, il est pertinent de mettre à jour la liste des modules à l'aide de la commande « *M-x package-refresh-contents* ».

Finalement, on roule la commande « *M-x httpd-serve-directory* ».
Dans la commande, il est important de choisir le dossier _/public_, car c'est là qu'on retrouve tous nos fichiers de type html.
Ensuite, on peut visiter le site web en allant au http://localhost:8080.

*** Aperçu d'un site utilisant des fichiers CSS
Il faut s'assurer que nos fichiers CSS sont dans le répertoire mis en ligne.
Dans notre cas, on retrouve tous les fichiers /CSS/ dans le dossier _./public/css_.
S'ils ne sont pas là, le navigateur web ne pourra tout simplement pas les trouver. 

* Création d'un visuel pour le site web

** Améliorations de base 
Déjà, on peut améliorer notre fichier de configuration (/build-site.el/) en copiant quelques lignes de code dans la liste des configurations. 
#+begin_src elisp
:with-author nil        ;; don't include author name
:with-creator t         ;; include Emacs and Org version in footer
:with-toc t             ;; include table of contents
:section-numbers nil    ;; don't include section numbers
:time-stamp-file nil))) ;; don't include time stamp in file
#+end_src
*** Retirer le bouton « Validate »
Il y a un bouton inutile, nous allons le retirer en renommant la variable /org-html-validation-link/ :
#+begin_src elisp
(setq org-html-validation-link nil)
#+end_src

** Les variables de publication
Pour connaître toutes les variables de publication, il est intéressant d'utiliser la commande d'aide classique *« C-h v* » directement sur la fonction « *org-publish-project-alist* » et de faire « *Tab* » pour avoir une liste des variables disponibles.
C'est essentiellement la même chose que faire « *M-x describle-variable* ».
La plupart des variables commencent par « *org-export-* », donc c'est assez simple de les identifier.
Avec « *Enter* » , on peut accéder à la documentation complète de la fonction.

