public/documentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-26 Fri 23:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Création du blorg</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Charles-Édouard Lizotte" />
<link rel="stylesheet" href="./css/simple.css" />
</head>
<body>
<div id="content">
<h1 class="title">Création du blorg</h1>

<div id="outline-container-org7898a17" class="outline-2">
<h2 id="org7898a17">L'objectif</h2>
<div class="outline-text-2" id="text-org7898a17">
</div>
<div id="outline-container-orgb82b69e" class="outline-3">
<h3 id="orgb82b69e">Mise en contexte</h3>
<div class="outline-text-3" id="text-orgb82b69e">
<p>
J'adore le langage Org, je le trouve particulièrement efficace pour produire des notes, des agendas et des journaux.
Voici quelques mois que je l'utilise dans le cadre de mon travail et j'aimerais maintenant créer moi-même un blog accessible pour tous.
Par contre, peu de sites web de type blog apprécient le formatage du langage Org, c'est pourquoi je me suis mis en tête de moi-même en créer un.
Ce document contient quelques notes importantes que j'ai prises au fil de mon parcours de création.
</p>
</div>
</div>

<div id="outline-container-org7beed3b" class="outline-3">
<h3 id="org7beed3b">Non, mais concrétement&#x2026;</h3>
<div class="outline-text-3" id="text-org7beed3b">
<p>
Nous allons publier (ou plutôt exporter) un fichier Org en fichier HTML dans le but de créer un site web.
Lorsqu'on entend le mot « <b>publier »</b>, on parle généralement de transformer notre fichier <b>org</b> en fichier <b>HTML</b>.
C'est ce que nous apprendrons à faire dans les prochaines minutes.
</p>
</div>
</div>
</div>

<div id="outline-container-org90c783b" class="outline-2">
<h2 id="org90c783b">Architecture de fichiers</h2>
<div class="outline-text-2" id="text-org90c783b">
<p>
Avant tout, nous avons besoin d'une forme d'architecture de gestion de nos publications.
Celle proposée par <a href="https://www.youtube.com/watch?v=AfkrzFodoNw">la chaîne Youtube System Crafter</a> fait la plus de sens :
</p>
<ul class="org-ul">
<li><b>build.sh</b> : un scrip bash qui exécute la mise à jour de nos fichiers org en fichiers HTML à l'aide du fichier <b>build-site.el</b>.</li>
<li><b>build-site.el</b> : un code <b>elisp</b> qui s'assure d'exécuter <b>Emacs</b> en mode -Q pour publier nos fichiers.</li>
<li>Dossier <b>/content</b> : où l'on retrouve le contenu du site web, comme les fichiers org ou la gabarits CSS.
<ul class="org-ul">
<li><b>content/index.org</b> : un fichier org représentant notre page principale.</li>
</ul></li>
<li>Dossier <b>/public</b> : Dossier des fichiers qui seront publiés vers le web (HTML, png, CSS).
Pour l'instant, on y retrouve que le fichier <i>index.org</i>.</li>
</ul>

<p>
Au final, le résultat désiré devrait ressembler à l'arbre suivant : 
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="font-weight: bold;">.</span>
&#9500;&#9472;&#9472; build.sh
&#9500;&#9472;&#9472; build-site.el
&#9500;&#9472;&#9472; content
&#9474;   &#9492;&#9472;&#9472; index.org
&#9500;&#9472;&#9472; css
&#9474;   &#9492;&#9472;&#9472; simple.css
&#9500;&#9472;&#9472; documentation.org
&#9492;&#9472;&#9472; public
    &#9500;&#9472;&#9472; css
    &#9474;   &#9492;&#9472;&#9472; simple.css
    &#9492;&#9472;&#9472; index.html
</pre>
</div>

<p>
Le fichier <i>build.sh</i> est un exécutable bash qui met à jour notre site web en exécutant notre script elisp : 
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">sh</span>
emacs -Q --script build-site.el
</pre>
</div>
</div>
</div>

<div id="outline-container-org39cd0f8" class="outline-2">
<h2 id="org39cd0f8">Création d'une configuration de publication web</h2>
<div class="outline-text-2" id="text-org39cd0f8">
<p>
Un fois nos scripts de base réalisés, on peut créer une configuration de publication dans le script <i>build-site.el</i>.
Commençons par une configuration de publication de nos fichiers HTML.
Les variables de publication devraient ressembler à
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define the publishing project</span>
(<span style="font-weight: bold;">setq</span> org-publish-project-alist
      (list
       (list <span style="font-style: italic;">"my-org-site"</span>
             <span style="font-weight: bold;">:recursive</span> t
             <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"./content"</span>
             <span style="font-weight: bold;">:publishing-directory</span> <span style="font-style: italic;">"./public"</span>
             <span style="font-weight: bold;">:publishing-function</span> 'org-html-publish-to-html)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Generate the site output</span>
(org-publish-all t)
(message <span style="font-style: italic;">"Build complete!"</span>)
</pre>
</div>
<p>
À la dernière ligne, la fonction de publication est exécutée de sorte à exporter les nouveaux fichiers HTML dans le dossier <i>./public</i>. 
</p>
</div>
</div>

<div id="outline-container-org72f7586" class="outline-2">
<h2 id="org72f7586">Un aperçu du site web en ligne</h2>
<div class="outline-text-2" id="text-org72f7586">
<p>
Pour voir un aperçu de notre site web <b>en ligne</b>, il existe un module Emacs qui peut abriter notre site sur notre machine, le temps de le tester.
Ce module s'appelle <a href="https://github.com/skeeto/emacs-web-server/blob/master/simple-httpd.el">simple-httpsd</a> et il s'installe à l'aide de MELPA, donc avec la commande « <b>M-x package-install</b> » ou en mettant la ligne de code suiante
</p>
<div class="org-src-container">
<pre class="src src-elisp">(use-package simple-httpd
  <span style="font-weight: bold;">:ensure</span> t)
</pre>
</div>
<p>
Si ça ne marche pas, il est pertinent de mettre à jour la liste des modules à l'aide de la commande « <b>M-x package-refresh-contents</b> ».
</p>

<p>
Finalement, on roule la commande « <b>M-x httpd-serve-directory</b> ».
Dans la commande, il est important de choisir le dossier <span class="underline">/public</span>, car c'est là qu'on retrouve tous nos fichiers de type html.
Ensuite, on peut visiter le site web en allant au <a href="http://localhost:8080">http://localhost:8080</a>.
</p>
</div>

<div id="outline-container-orge6fc790" class="outline-4">
<h4 id="orge6fc790">Aperçu d'un site utilisant des fichiers CSS</h4>
<div class="outline-text-4" id="text-orge6fc790">
<p>
Il faut s'assurer que nos fichiers CSS sont dans le répertoire mis en ligne.
Dans notre cas, on retrouve tous les fichiers <i>CSS</i> dans le dossier <span class="underline">./public/css</span>.
S'ils ne sont pas là, le navigateur web ne pourra tout simplement pas les trouver. 
</p>
</div>
</div>
</div>

<div id="outline-container-org9bb3a5b" class="outline-2">
<h2 id="org9bb3a5b">Création d'un visuel pour le site web</h2>
<div class="outline-text-2" id="text-org9bb3a5b">
</div>
<div id="outline-container-org50797f1" class="outline-3">
<h3 id="org50797f1">Améliorations de base</h3>
<div class="outline-text-3" id="text-org50797f1">
<p>
Déjà, on peut améliorer notre fichier de configuration (<i>build-site.el</i>) en copiant quelques lignes de code dans la liste des configurations. 
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold;">:with-author</span> nil        <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">don't include author name</span>
<span style="font-weight: bold;">:with-creator</span> t         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">include Emacs and Org version in footer</span>
<span style="font-weight: bold;">:with-toc</span> t             <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">include table of contents</span>
<span style="font-weight: bold;">:section-numbers</span> nil    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">don't include section numbers</span>
<span style="font-weight: bold;">:time-stamp-file</span> nil))) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">don't include time stamp in file</span>
</pre>
</div>
</div>
<div id="outline-container-org29ad1df" class="outline-4">
<h4 id="org29ad1df">Retirer le bouton « Validate »</h4>
<div class="outline-text-4" id="text-org29ad1df">
<p>
Il y a un bouton inutile, nous allons le retirer en renommant la variable <i>org-html-validation-link</i> :
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">setq</span> org-html-validation-link nil)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org643235c" class="outline-3">
<h3 id="org643235c">Les variables de publication</h3>
<div class="outline-text-3" id="text-org643235c">
<p>
Pour connaître toutes les variables de publication, il est intéressant d'utiliser la commande d'aide classique <b>« C-h v</b> » directement sur la fonction « <b>org-publish-project-alist</b> » et de faire « <b>Tab</b> » pour avoir une liste des variables disponibles.
C'est essentiellement la même chose que faire « <b>M-x describle-variable</b> ».
La plupart des variables commencent par « <b>org-export-</b> », donc c'est assez simple de les identifier.
Avec « <b>Enter</b> » , on peut accéder à la documentation complète de la fonction.
</p>
</div>
</div>
