content/documentation.org
** Simple CSS
Ok, le texte est là, mais le reste du site web est hideux sur le plan visuel.
Heureusement, quelqu'un a codé un script de style CSS (/Cascading Style Sheet/) extrêmement compacte, soit une base sur laquelle il est aisé de construire quelque chose d'intéressant.
Ça s'appelle [[https://simplecss.org/][simple.css]] et ça vaut la peine de l'utiliser pour commencer.
Pour se faire, il suffit de copier les lignes suivantes dans notre _/build-site.el_ : 
#+begin_src elisp
;; Customize the HTML output
(setq org-html-validation-link nil            ;; Don't show validation link
      org-html-head-include-scripts nil       ;; Use our own scripts
      org-html-head-include-default-style nil ;; Use our own styles
      org-html-head "<link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" />")
#+end_src
Le résultat est immédiat et surprenant.

** Inclure d'autres gabarits CSS
En premier lieu, il faut télécharger un gabarit CSS.
[[https://thomasf.github.io/solarized-css/][Solarized CSS]] offre une belle alternative pour débuter, par exemple.
Une fois le téléchargement réalisé, il faut modifier les paramètres d'exportation de sorte à prendre notre gabarit CSS. 
#+begin_src elisp
;; Customize the HTML output
   (setq org-html-validation-link nil             ;; Don't show validation link
      org-html-head-include-scripts nil           ;; Use our own scripts
      org-html-head-include-default-style nil     ;; Use our own styles
      org-html-head "<link rel=\"stylesheet\" href=\"./css/stylesheet.css\" />")  ;; Où trouver le fichier CSS
#+end_src
Mais, pour que ça fonctionne en ligne, il fuat impérativement que les gabarits CSS se retrouvent aussi dans le dossier exporté en ligne.
C'est pourquoi on doit eux-aussi les exporter dans le dossier /./public/css/.
Il faut donc dire à notre fonction de publication d'exporter les fichiers CSS dans le dossier /./public/. 
Pour faire ça, on modifie nos variables de publication pour la fonction « *org-publish-attachment* ».
Grossièrement, on ajoute une nouvelle variable de publication appelée « *org-css* » qui va faire ça.
#+begin_src elisp
;; Define the publishing project
(setq org-publish-project-alist
      (list
       (list "org-blog"
	     :recursive t
	     :base-directory "./content"
	     :publishing-directory "./public"
	     :base-extension "org"
	     :publishing-function 'org-html-publish-to-html
	     :with-author t              ;; don't include author name
	     :with-creator t             ;; include Emacs and Org version in footer
	     :with-toc nil               ;; include table of contents
	     :section-numbers nil        ;; don't include section numbers
	     :time-stamp-file nil)       ;; don't include time stamp in file
       
       ;; On publie les fichier CSS en css dans ./public/css
       (list "org-css"
             :base-directory "css/"
             :base-extension "css"
             :publishing-directory "public/css"
             :recursive t
             :publishing-function 'org-publish-attachment
             )))
#+end_src
Tout cela pour s'assurer que les fichiers CSS seront accessibles pour le navigateur web, comme proposé dans le [[https://kansi.gitlab.io/blog_setup_with_emacs.html][blog de Vanshdeep Singh]].

* Aller plus loin

** Création d'une « sitemap » simple
Un bon [[https://opensource.com/article/20/3/blog-emacs][tutoriel du site opensource.com]] nous renseigne sur l'utilisation d'une /sitemap/.
Grossièrement, on peut se débarasser du fichier d'index pour laisser notre fonction de publication s'en occuper.
Pour se faire, on supprime le fichier d'index et l'on rajoute les variables
#+begin_src elisp
	     ;; Publication index
           :auto-sitemap t
	     :sitemap-title "Index du blogue"
	     :sitemap-filename "index.org"
	     :sitemap-style 'list
	     :author "Charles-Édouard Lizotte"
	     :email "charlesedouardlizotte@protonmail.com")
#+end_src
dans la liste des variables de org-blog.

