public/documentation.html

<div id="outline-container-orgf269e6f" class="outline-3">
<h3 id="orgf269e6f">Simple CSS</h3>
<div class="outline-text-3" id="text-orgf269e6f">
<p>
Ok, le texte est là, mais le reste du site web est hideux sur le plan visuel.
Heureusement, quelqu'un a codé un script de style CSS (<i>Cascading Style Sheet</i>) extrêmement compacte, soit une base sur laquelle il est aisé de construire quelque chose d'intéressant.
Ça s'appelle <a href="https://simplecss.org/">simple.css</a> et ça vaut la peine de l'utiliser pour commencer.
Pour se faire, il suffit de copier les lignes suivantes dans notre <span class="underline">/build-site.el</span> : 
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Customize the HTML output</span>
(<span style="font-weight: bold;">setq</span> org-html-validation-link nil            <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't show validation link</span>
      org-html-head-include-scripts nil       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use our own scripts</span>
      org-html-head-include-default-style nil <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use our own styles</span>
      org-html-head <span style="font-style: italic;">"&lt;link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" /&gt;"</span>)
</pre>
</div>
<p>
Le résultat est immédiat et surprenant.
</p>
</div>
</div>

<div id="outline-container-org63189df" class="outline-3">
<h3 id="org63189df">Inclure d'autres gabarits CSS</h3>
<div class="outline-text-3" id="text-org63189df">
<p>
En premier lieu, il faut télécharger un gabarit CSS.
<a href="https://thomasf.github.io/solarized-css/">Solarized CSS</a> offre une belle alternative pour débuter, par exemple.
Une fois le téléchargement réalisé, il faut modifier les paramètres d'exportation de sorte à prendre notre gabarit CSS. 
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Customize the HTML output</span>
   (<span style="font-weight: bold;">setq</span> org-html-validation-link nil             <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't show validation link</span>
      org-html-head-include-scripts nil           <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use our own scripts</span>
      org-html-head-include-default-style nil     <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use our own styles</span>
      org-html-head <span style="font-style: italic;">"&lt;link rel=\"stylesheet\" href=\"./css/stylesheet.css\" /&gt;"</span>)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">O&#249; trouver le fichier CSS</span>
</pre>
</div>
<p>
Mais, pour que ça fonctionne en ligne, il fuat impérativement que les gabarits CSS se retrouvent aussi dans le dossier exporté en ligne.
C'est pourquoi on doit eux-aussi les exporter dans le dossier <i>./public/css</i>.
Il faut donc dire à notre fonction de publication d'exporter les fichiers CSS dans le dossier <i>./public</i>. 
Pour faire ça, on modifie nos variables de publication pour la fonction « <b>org-publish-attachment</b> ».
Grossièrement, on ajoute une nouvelle variable de publication appelée « <b>org-css</b> » qui va faire ça.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define the publishing project</span>
(<span style="font-weight: bold;">setq</span> org-publish-project-alist
      (list
       (list <span style="font-style: italic;">"org-blog"</span>
             <span style="font-weight: bold;">:recursive</span> t
             <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"./content"</span>
             <span style="font-weight: bold;">:publishing-directory</span> <span style="font-style: italic;">"./public"</span>
             <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
             <span style="font-weight: bold;">:publishing-function</span> 'org-html-publish-to-html
             <span style="font-weight: bold;">:with-author</span> t              <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">don't include author name</span>
             <span style="font-weight: bold;">:with-creator</span> t             <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">include Emacs and Org version in footer</span>
             <span style="font-weight: bold;">:with-toc</span> nil               <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">include table of contents</span>
             <span style="font-weight: bold;">:section-numbers</span> nil        <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">don't include section numbers</span>
             <span style="font-weight: bold;">:time-stamp-file</span> nil)       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">don't include time stamp in file</span>

       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">On publie les fichier CSS en css dans ./public/css</span>
       (list <span style="font-style: italic;">"org-css"</span>
             <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"css/"</span>
             <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css"</span>
             <span style="font-weight: bold;">:publishing-directory</span> <span style="font-style: italic;">"public/css"</span>
             <span style="font-weight: bold;">:recursive</span> t
             <span style="font-weight: bold;">:publishing-function</span> 'org-publish-attachment
             )))
</pre>
</div>
<p>
Tout cela pour s'assurer que les fichiers CSS seront accessibles pour le navigateur web, comme proposé dans le <a href="https://kansi.gitlab.io/blog_setup_with_emacs.html">blog de Vanshdeep Singh</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org3a21afc" class="outline-2">
<h2 id="org3a21afc">Aller plus loin</h2>
<div class="outline-text-2" id="text-org3a21afc">
</div>
<div id="outline-container-org0141fdd" class="outline-3">
<h3 id="org0141fdd">Création d'une « sitemap » simple</h3>
<div class="outline-text-3" id="text-org0141fdd">
<p>
Un bon <a href="https://opensource.com/article/20/3/blog-emacs">tutoriel du site opensource.com</a> nous renseigne sur l'utilisation d'une <i>sitemap</i>.
Grossièrement, on peut se débarasser du fichier d'index pour laisser notre fonction de publication s'en occuper.
Pour se faire, on supprime le fichier d'index et l'on rajoute les variables
</p>
<div class="org-src-container">
<pre class="src src-elisp">  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Publication index</span>
<span style="font-weight: bold;">:auto-sitemap</span> t
  <span style="font-weight: bold;">:sitemap-title</span> <span style="font-style: italic;">"Index du blogue"</span>
  <span style="font-weight: bold;">:sitemap-filename</span> <span style="font-style: italic;">"index.org"</span>
  <span style="font-weight: bold;">:sitemap-style</span> 'list
  <span style="font-weight: bold;">:author</span> <span style="font-style: italic;">"Charles-&#201;douard Lizotte"</span>
  <span style="font-weight: bold;">:email</span> <span style="font-style: italic;">"charlesedouardlizotte@protonmail.com"</span>)
</pre>
</div>
<p>
dans la liste des variables de org-blog.
</p>
</div>
</div>
