content/documentation.org
** Création d'une fonction pour la « sitemap »
Dans le blogue parfait, ma page d'/indexe/ illustrerait des liens, ainsi qu'une date de création, de sorte à trier de maniètre chronologique nos textes.
pour se faire, il faut modifier la variable *:sitemap-style*.
Par contre, ça ne fonctionne pas, car Org est en constante modification et il se peut que la variable soit légèrement désuette si on la transforme telle que
#+begin_src elisp
  :sitemap-style "%d - %t"
#+end_src
par exemple.

Grossièrement, la [[https://orgmode.org/manual/Site-map.html][documentation de Org-mode sur la /sitemap]] donne très peu d'information sur la création d'une belle /sitemap/ -- même chose du côté de la [[https://doc.endlessparentheses.com/Var/org-publish-project-alist.html][documentation de Endless Parentheses]]. 
De son côté, le [[https://ogbe.net/blog/org_custom_sitemap][blogue de Dennis Ogbe]] offre beaucoup d'information sur la structure, mais je n'y comprend absolument rien, faute de talent.
C'est pourquoi j'ai cherché une solution plus simple et c'est ce que j'ai trouvé du côté du [[https://miikanissi.com/blog/website-with-emacs/][blogue de Miikanissi]] et que j'ai un peu modifiée :
#+begin_src elisp
(defun my-sitemap-func (title list)
  "Sitemap generation function."
  (concat "#+Title:"
	  title
	  "\n\n"
	  (org-list-to-subtree list)))
#+end_src
La fonction de notre /site-map/ devrait sortir une liste de lien Org et un titre.

[[https://pank.eu/blog/blog-setup.html][Rasmus Pank et son blogue]] arrivent en sauveurs :
Au fond, on est en train de *créer* un fichier d'index, donc la fonction de *:sitemap-function* devrait donner du texte.




* Ressources et remerciements

*** Création d'une architecture Org et publication HTML
+ [[https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/][System Crafter]]
  
*** Gabarit HTML de base
+ [[https://simplecss.org/][Simple.css]]
+ [[https://thomasf.github.io/solarized-css/][Solarized CSS]]

*** Gérer la fonction de publication
+ [[https://kansi.gitlab.io/blog_setup_with_emacs.html][Blog de Vanshdeep Singh]]

+ 
