public/documentation.html

<div id="outline-container-org9192e52" class="outline-3">
<h3 id="org9192e52">Création d'une fonction pour la « sitemap »</h3>
<div class="outline-text-3" id="text-org9192e52">
<p>
Dans le blogue parfait, ma page d'<i>indexe</i> illustrerait des liens, ainsi qu'une date de création, de sorte à trier de maniètre chronologique nos textes.
pour se faire, il faut modifier la variable <b>:sitemap-style</b>.
Par contre, ça ne fonctionne pas, car Org est en constante modification et il se peut que la variable soit légèrement désuette si on la transforme telle que
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold;">:sitemap-style</span> <span style="font-style: italic;">"%d - %t"</span>
</pre>
</div>
<p>
par exemple.
</p>

<p>
Grossièrement, la <a href="https://orgmode.org/manual/Site-map.html">documentation de Org-mode sur la /sitemap</a> donne très peu d'information sur la création d'une belle <i>sitemap</i> &#x2013; même chose du côté de la <a href="https://doc.endlessparentheses.com/Var/org-publish-project-alist.html">documentation de Endless Parentheses</a>. 
De son côté, le <a href="https://ogbe.net/blog/org_custom_sitemap">blogue de Dennis Ogbe</a> offre beaucoup d'information sur la structure, mais je n'y comprend absolument rien, faute de talent.
C'est pourquoi j'ai cherché une solution plus simple et c'est ce que j'ai trouvé du côté du <a href="https://miikanissi.com/blog/website-with-emacs/">blogue de Miikanissi</a> et que j'ai un peu modifiée :
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-sitemap-func</span> (title list)
  <span style="font-style: italic;">"Sitemap generation function."</span>
  (concat <span style="font-style: italic;">"#+Title:"</span>
          title
          <span style="font-style: italic;">"\n\n"</span>
          (org-list-to-subtree list)))
</pre>
</div>
<p>
La fonction de notre <i>site-map</i> devrait sortir une liste de lien Org et un titre.
</p>

<p>
<a href="https://pank.eu/blog/blog-setup.html">Rasmus Pank et son blogue</a> arrivent en sauveurs :
Au fond, on est en train de <b>créer</b> un fichier d'index, donc la fonction de <b>:sitemap-function</b> devrait donner du texte.
</p>
</div>
</div>
</div>




<div id="outline-container-org27beee8" class="outline-2">
<h2 id="org27beee8">Ressources et remerciements</h2>
<div class="outline-text-2" id="text-org27beee8">
</div>
<div id="outline-container-org4e830e2" class="outline-4">
<h4 id="org4e830e2">Création d'une architecture Org et publication HTML</h4>
<div class="outline-text-4" id="text-org4e830e2">
<ul class="org-ul">
<li><a href="https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/">System Crafter</a></li>
</ul>
</div>
</div>

<div id="outline-container-org499a919" class="outline-4">
<h4 id="org499a919">Gabarit HTML de base</h4>
<div class="outline-text-4" id="text-org499a919">
<ul class="org-ul">
<li><a href="https://simplecss.org/">Simple.css</a></li>
<li><a href="https://thomasf.github.io/solarized-css/">Solarized CSS</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7d58e6c" class="outline-4">
<h4 id="org7d58e6c">Gérer la fonction de publication</h4>
<div class="outline-text-4" id="text-org7d58e6c">
<ul class="org-ul">
<li><a href="https://kansi.gitlab.io/blog_setup_with_emacs.html">Blog de Vanshdeep Singh</a></li>

<li></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-01-25 Thu 00:00</p>
<p class="author">Author: Charles-Édouard Lizotte</p>
<p class="date">Created: 2024-01-26 Fri 23:59</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
